## 📋 Terragrunt Plan Results

**Project**: claude-code-action
**Environment**: `develop`
**Directory**: `infrastructures/claude-code-action/terragrunt/envs/develop`
**Status**: ✅ Success
**Action**: plan

<details>
<summary>📝 Plan Output</summary>

```hcl
17:39:44.805 INFO   Downloading Terraform configurations from ../../modules into ./.terragrunt-cache/my1UPtLMQLjicnyXBzdFZQO2ZLc/lpQGwm1_HFfaA93KgqixzLjaxyE
17:39:45.898 INFO   terraform: Initializing the backend...
17:39:47.131 INFO   terraform: 
17:39:47.131 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
17:39:47.131 INFO   terraform: use this backend unless the backend configuration changes.
17:39:48.111 INFO   terraform: Initializing provider plugins...
17:39:48.111 INFO   terraform: - Finding hashicorp/aws versions matching "~> 5.0"...
17:39:48.151 INFO   terraform: - Finding hashicorp/tls versions matching "~> 4.0"...
17:39:48.282 INFO   terraform: - Installing hashicorp/aws v5.100.0...
17:39:52.275 INFO   terraform: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
17:39:52.387 INFO   terraform: - Installing hashicorp/tls v4.1.0...
17:39:52.569 INFO   terraform: - Installed hashicorp/tls v4.1.0 (signed by HashiCorp)
17:39:52.569 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
17:39:52.569 INFO   terraform: selections it made above. Include this file in your version control repository
17:39:52.569 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
17:39:52.569 INFO   terraform: you run "terraform init" in the future.
17:39:52.569 INFO   terraform: Terraform has been successfully initialized!
17:39:54.838 STDOUT terraform: Acquiring state lock. This may take a few moments...
17:39:57.700 STDOUT terraform: data.aws_caller_identity.current: Reading...
17:39:57.849 STDOUT terraform: data.aws_caller_identity.current: Read complete after 0s [id=559744160976]
17:39:57.987 STDOUT terraform: Terraform used the selected providers to generate the following execution
17:39:57.987 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
17:39:57.987 STDOUT terraform:   + create
17:39:57.987 STDOUT terraform: Terraform will perform the following actions:
17:39:57.987 STDOUT terraform:   # aws_iam_policy.bedrock_claude_policy will be created
17:39:57.987 STDOUT terraform:   + resource "aws_iam_policy" "bedrock_claude_policy" {
17:39:57.987 STDOUT terraform:       + arn              = (known after apply)
17:39:57.987 STDOUT terraform:       + attachment_count = (known after apply)
17:39:57.987 STDOUT terraform:       + description      = "Policy for Claude Code Action to access Amazon Bedrock Claude models"
17:39:57.988 STDOUT terraform:       + id               = (known after apply)
17:39:57.988 STDOUT terraform:       + name             = "claude-code-action-develop-bedrock-claude-policy"
17:39:57.988 STDOUT terraform:       + name_prefix      = (known after apply)
17:39:57.988 STDOUT terraform:       + path             = "/"
17:39:57.988 STDOUT terraform:       + policy           = jsonencode(
17:39:57.988 STDOUT terraform:             {
17:39:57.988 STDOUT terraform:               + Statement = [
17:39:57.988 STDOUT terraform:                   + {
17:39:57.988 STDOUT terraform:                       + Action   = [
17:39:57.988 STDOUT terraform:                           + "bedrock:InvokeModel",
17:39:57.988 STDOUT terraform:                           + "bedrock:InvokeModelWithResponseStream",
17:39:57.988 STDOUT terraform:                         ]
17:39:57.988 STDOUT terraform:                       + Effect   = "Allow"
17:39:57.988 STDOUT terraform:                       + Resource = "*"
17:39:57.988 STDOUT terraform:                     },
17:39:57.988 STDOUT terraform:                   + {
17:39:57.988 STDOUT terraform:                       + Action   = [
17:39:57.988 STDOUT terraform:                           + "bedrock:ListFoundationModels",
17:39:57.988 STDOUT terraform:                           + "bedrock:GetFoundationModel",
17:39:57.988 STDOUT terraform:                         ]
17:39:57.988 STDOUT terraform:                       + Effect   = "Allow"
17:39:57.988 STDOUT terraform:                       + Resource = "*"
17:39:57.988 STDOUT terraform:                     },
17:39:57.988 STDOUT terraform:                 ]
17:39:57.988 STDOUT terraform:               + Version   = "2012-10-17"
17:39:57.988 STDOUT terraform:             }
17:39:57.989 STDOUT terraform:         )
17:39:57.989 STDOUT terraform:       + policy_id        = (known after apply)
17:39:57.989 STDOUT terraform:       + tags             = {
17:39:57.989 STDOUT terraform:           + "CostCenter"  = "engineering"
17:39:57.989 STDOUT terraform:           + "Environment" = "develop"
17:39:57.989 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
17:39:57.989 STDOUT terraform:           + "Name"        = "claude-code-action-develop-bedrock-claude-policy"
17:39:57.989 STDOUT terraform:           + "Owner"       = "panicboat"
17:39:57.989 STDOUT terraform:           + "Project"     = "claude-code-action"
17:39:57.989 STDOUT terraform:           + "Purpose"     = "bedrock-claude-access"
17:39:57.989 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
17:39:57.989 STDOUT terraform:         }
17:39:57.989 STDOUT terraform:       + tags_all         = {
17:39:57.989 STDOUT terraform:           + "CostCenter"  = "engineering"
17:39:57.989 STDOUT terraform:           + "Environment" = "develop"
17:39:57.989 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
17:39:57.989 STDOUT terraform:           + "Name"        = "claude-code-action-develop-bedrock-claude-policy"
17:39:57.989 STDOUT terraform:           + "Owner"       = "panicboat"
17:39:57.989 STDOUT terraform:           + "Project"     = "claude-code-action"
17:39:57.989 STDOUT terraform:           + "Purpose"     = "bedrock-claude-access"
17:39:57.990 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
17:39:57.990 STDOUT terraform:         }
17:39:57.990 STDOUT terraform:     }
17:39:57.990 STDOUT terraform:   # aws_iam_role.claude_code_action_role will be created
17:39:57.990 STDOUT terraform:   + resource "aws_iam_role" "claude_code_action_role" {
17:39:57.990 STDOUT terraform:       + arn                   = (known after apply)
17:39:57.990 STDOUT terraform:       + assume_role_policy    = jsonencode(
17:39:57.990 STDOUT terraform:             {
17:39:57.990 STDOUT terraform:               + Statement = [
17:39:57.990 STDOUT terraform:                   + {
17:39:57.990 STDOUT terraform:                       + Action    = "sts:AssumeRoleWithWebIdentity"
17:39:57.990 STDOUT terraform:                       + Condition = {
17:39:57.990 STDOUT terraform:                           + StringEquals = {
17:39:57.990 STDOUT terraform:                               + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
17:39:57.990 STDOUT terraform:                             }
17:39:57.990 STDOUT terraform:                           + StringLike   = {
17:39:57.990 STDOUT terraform:                               + "token.actions.githubusercontent.com:sub" = [
17:39:57.990 STDOUT terraform:                                   + "repo:panicboat/monorepo:*",
17:39:57.991 STDOUT terraform:                                 ]
17:39:57.991 STDOUT terraform:                             }
17:39:57.991 STDOUT terraform:                         }
17:39:57.991 STDOUT terraform:                       + Effect    = "Allow"
17:39:57.991 STDOUT terraform:                       + Principal = {
17:39:57.991 STDOUT terraform:                           + Federated = "arn:aws:iam::559744160976:oidc-provider/token.actions.githubusercontent.com"
17:39:57.991 STDOUT terraform:                         }
17:39:57.991 STDOUT terraform:                     },
17:39:57.991 STDOUT terraform:                 ]
17:39:57.991 STDOUT terraform:               + Version   = "2012-10-17"
17:39:57.991 STDOUT terraform:             }
17:39:57.991 STDOUT terraform:         )
17:39:57.991 STDOUT terraform:       + create_date           = (known after apply)
17:39:57.991 STDOUT terraform:       + force_detach_policies = false
17:39:57.991 STDOUT terraform:       + id                    = (known after apply)
17:39:57.991 STDOUT terraform:       + managed_policy_arns   = (known after apply)
17:39:57.991 STDOUT terraform:       + max_session_duration  = 7200
17:39:57.991 STDOUT terraform:       + name                  = "claude-code-action-develop-github-actions-role"
17:39:57.991 STDOUT terraform:       + name_prefix           = (known after apply)
17:39:57.991 STDOUT terraform:       + path                  = "/"
17:39:57.991 STDOUT terraform:       + tags                  = {
17:39:57.991 STDOUT terraform:           + "CostCenter"  = "engineering"
17:39:57.991 STDOUT terraform:           + "Environment" = "develop"
17:39:57.991 STDOUT terraform:           + "GitHubOrg"   = "panicboat"
17:39:57.991 STDOUT terraform:           + "GitHubRepos" = "monorepo"
17:39:57.992 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
17:39:57.992 STDOUT terraform:           + "Name"        = "claude-code-action-develop-github-actions-role"
17:39:57.992 STDOUT terraform:           + "Owner"       = "panicboat"
17:39:57.992 STDOUT terraform:           + "Project"     = "claude-code-action"
17:39:57.992 STDOUT terraform:           + "Purpose"     = "claude-code-action-bedrock"
17:39:57.992 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
17:39:57.992 STDOUT terraform:         }
17:39:57.992 STDOUT terraform:       + tags_all              = {
17:39:57.992 STDOUT terraform:           + "CostCenter"  = "engineering"
17:39:57.992 STDOUT terraform:           + "Environment" = "develop"
17:39:57.992 STDOUT terraform:           + "GitHubOrg"   = "panicboat"
17:39:57.992 STDOUT terraform:           + "GitHubRepos" = "monorepo"
17:39:57.992 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
17:39:57.992 STDOUT terraform:           + "Name"        = "claude-code-action-develop-github-actions-role"
17:39:57.992 STDOUT terraform:           + "Owner"       = "panicboat"
17:39:57.992 STDOUT terraform:           + "Project"     = "claude-code-action"
17:39:57.992 STDOUT terraform:           + "Purpose"     = "claude-code-action-bedrock"
17:39:57.992 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
17:39:57.992 STDOUT terraform:         }
17:39:57.992 STDOUT terraform:       + unique_id             = (known after apply)
17:39:57.992 STDOUT terraform:       + inline_policy (known after apply)
17:39:57.992 STDOUT terraform:     }
17:39:57.992 STDOUT terraform:   # aws_iam_role_policy_attachment.bedrock_claude_policy_attachment will be created
17:39:57.993 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "bedrock_claude_policy_attachment" {
17:39:57.993 STDOUT terraform:       + id         = (known after apply)
17:39:57.993 STDOUT terraform:       + policy_arn = (known after apply)
17:39:57.993 STDOUT terraform:       + role       = "claude-code-action-develop-github-actions-role"
17:39:57.993 STDOUT terraform:     }
17:39:57.993 STDOUT terraform: Plan: 3 to add, 0 to change, 0 to destroy.
17:39:57.993 STDOUT terraform: 
17:39:57.993 STDOUT terraform: Changes to Outputs:
17:39:57.993 STDOUT terraform:   + bedrock_models               = [
17:39:57.993 STDOUT terraform:       + "anthropic.claude-3-7-sonnet-20250219-v1:0",
17:39:57.993 STDOUT terraform:     ]
17:39:57.993 STDOUT terraform:   + bedrock_policy_arn           = (known after apply)
17:39:57.993 STDOUT terraform:   + claude_model_region          = "us-west-2"
17:39:57.993 STDOUT terraform:   + github_actions_configuration = {
17:39:57.993 STDOUT terraform:       + aws_region          = "ap-northeast-1"
17:39:57.993 STDOUT terraform:       + bedrock_models      = [
17:39:57.993 STDOUT terraform:           + "anthropic.claude-3-7-sonnet-20250219-v1:0",
17:39:57.993 STDOUT terraform:         ]
17:39:57.993 STDOUT terraform:       + claude_model_region = "us-west-2"
17:39:57.993 STDOUT terraform:       + role_arn            = (known after apply)
17:39:57.993 STDOUT terraform:     }
17:39:57.993 STDOUT terraform:   + iam_role_arn                 = (known after apply)
17:39:57.993 STDOUT terraform:   + iam_role_name                = "claude-code-action-develop-github-actions-role"
```
</details>

[View full workflow logs](https://github.com/panicboat/monorepo/actions/runs/15809184544)
---
*Triggered by workflow automation system*
<!-- thollander/actions-comment-pull-request "terragrunt-plan-develop-claude-code-action" -->